tap "alecthomas/tap"
tap "aquasecurity/trivy"
tap "atombender/ktail"
tap "civo/tools"
tap "cloudflare/cloudflare"
tap "doctave/doctave"
tap "dopplerhq/cli"
tap "ethereum/ethereum"
tap "fairwindsops/tap"
tap "gabrie30/utils"
tap "getsentry/tools"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "johanhaleby/kubetail"
tap "kyma-incubator/kyma-incubator"
tap "liamg/tfsec"
tap "lingrino/tap"
tap "linuxkit/linuxkit"
tap "mike-engel/jwt-cli"
tap "minamijoyo/tfmigrate"
tap "minio/stable"
tap "mongodb/brew"
tap "norwoodj/tap"
tap "phrase/brewed"
tap "profclems/tap"
tap "sigstore/tap"
tap "vmware-tanzu/buildkit-cli-for-kubectl", "https://github.com/vmware-tanzu/buildkit-cli-for-kubectl"
tap "weaveworks/tap"
tap "windmilleng/tap"
tap "zaquestion/tap"
brew "ansible-lint", link: false
brew "argocd"
brew "gettext"
brew "git"
brew "asdf"
brew "autoconf"
brew "automake"
brew "awk"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bcrypt"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "caddy"
brew "calicoctl"
brew "certigo"
brew "chainsaw"
brew "chart-testing"
brew "openblas"
brew "checkov"
brew "cilium-cli"
brew "cli53"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "conftest"
brew "coreutils"
brew "cosign"
brew "cue"
brew "curl"
brew "dive"
brew "doctl"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "ethereum"
brew "ffmpeg"
brew "fish"
brew "fx"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "gifsicle"
brew "git-cliff"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "git-gui"
brew "git-lfs"
brew "gitleaks"
brew "gitui"
brew "glab"
brew "gmailctl"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "pkgconf"
brew "gobject-introspection"
brew "gradle"
brew "netpbm"
brew "libtool"
brew "graphviz"
brew "grep"
brew "gron"
brew "gzip"
brew "hcl2json"
brew "hcloud"
brew "helm"
brew "helmfile"
brew "hey"
brew "htop"
brew "hub"
brew "hugo"
brew "python@3.11"
brew "icdiff"
brew "imagemagick"
brew "infracost"
brew "instaloader"
brew "isort"
brew "istioctl"
brew "jless"
brew "jq"
brew "k3d"
brew "k6"
brew "k9s"
brew "kind"
brew "kompose"
brew "krew"
brew "kubeconform"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "libpq"
brew "logcli"
brew "make"
brew "mas"
brew "maven"
brew "mdbtools"
brew "minikube"
brew "mkcert"
brew "mockery"
brew "mosh"
brew "neovim"
brew "nmap"
brew "nss"
brew "openssh"
brew "pam-u2f"
brew "pandoc"
brew "parallel"
brew "pgcli"
brew "pidgin"
brew "pinentry-mac"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "pre-commit", link: false
brew "putty"
brew "pv"
brew "pwgen"
brew "pydantic", link: false
brew "python@3.9"
brew "qemu"
brew "rclone"
brew "rename"
brew "restic"
brew "ripgrep"
brew "rpds-py", link: false
brew "rsync"
brew "ruff"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "socat"
brew "sops"
brew "sshuttle"
brew "starship"
brew "stern"
brew "telnet"
brew "terraform-docs"
brew "terragrunt"
brew "terramate"
brew "terrascan"
brew "tflint"
brew "tmux"
brew "tree"
brew "unzip"
brew "vegeta"
brew "velero"
brew "watch"
brew "watchman"
brew "wget"
brew "whois"
brew "wireguard-tools"
brew "ykman"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "alecthomas/tap/gometalinter"
brew "aquasecurity/trivy/trivy"
brew "atombender/ktail/ktail"
brew "civo/tools/civo"
brew "cloudflare/cloudflare/cf-terraforming"
brew "dopplerhq/cli/doppler"
brew "fairwindsops/tap/pluto"
brew "fairwindsops/tap/rbac-lookup"
brew "gabrie30/utils/ghorg"
brew "golangci/tap/golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/vault"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "liamg/tfsec/tfsec"
brew "lingrino/tap/glen"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
brew "mike-engel/jwt-cli/jwt-cli"
brew "minamijoyo/tfmigrate/tfmigrate"
brew "minio/stable/minio"
brew "norwoodj/tap/helm-docs"
brew "phrase/brewed/phraseapp"
brew "sigstore/tap/gitsign"
brew "windmilleng/tap/tilt"
brew "zaquestion/tap/lab"
cask "1password-cli"
cask "alacritty"
cask "caffeine"
cask "coconutbattery"
cask "font-hack-nerd-font"
cask "font-sf-mono-for-powerline"
cask "gcloud-cli"
cask "ghostty"
cask "keybase"
cask "kitty"
cask "minishift"
cask "mongodb-compass"
cask "signal"
cask "swiftbar"
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewmarkle.primer-light"
vscode "anoff.theme-monokai-light"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bokuweb.vscode-ripgrep"
vscode "casualjim.gotemplate"
vscode "chdsbd.github-code-owners"
vscode "chintans98.markdown-jira"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-markdown"
vscode "donjayamanne.python-environment-manager"
vscode "dynoser.helml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntwork.terragrunt-ls"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hyzeta.vscode-theme-github-light"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jakebathman.nginx-log-highlighter"
vscode "jallen7usa.vscode-cue-fmt"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jetmartin.bats"
vscode "joshuapoehls.json-escaper"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marcostazi.vs-code-vagrantfile"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "mineiros.terramate"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "nickgo.cuelang"
vscode "nsfilho.tosnippet"
vscode "premparihar.gotestexplorer"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "samuelcolvin.jinjahtml"
vscode "shanoor.vscode-nginx"
vscode "tamasfe.even-better-toml"
vscode "tanaka-x.prop2yaml"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "tylerharris.terraform-link-docs"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "windmilleng.vscode-go-autotest"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "xaver.theme-ysgrifennwr"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
