# ─── Taps ────────────────────────────────────────────────────────────────────
tap "ankitpokhrel/jira-cli"
tap "atombender/ktail"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mike-engel/jwt-cli"
tap "norwoodj/tap"
tap "sigstore/tap"
tap "terror/tap"

# ─── Shell & Core Utilities ──────────────────────────────────────────────────
brew "ast-grep"
brew "awk"
brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "htop"
brew "make"
brew "parallel"
brew "pv"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "starship"
brew "tmux"
brew "tree"
brew "unzip"
brew "watch"
brew "wget"
brew "whois"
brew "zsh"
brew "zsh-completions"

# ─── Git ─────────────────────────────────────────────────────────────────────
brew "bfg"
brew "git"
brew "git-cliff"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "git-gui"
brew "git-lfs"
brew "gitleaks"
brew "gitui"
brew "icdiff"
brew "sigstore/tap/gitsign"

# ─── Languages & Runtimes ────────────────────────────────────────────────────
brew "asdf"

# ─── Python Tooling ──────────────────────────────────────────────────────────
brew "uv"

# ─── Node Tooling ────────────────────────────────────────────────────────────
brew "pnpm"

# ─── Build Tools ─────────────────────────────────────────────────────────────
brew "autoconf"
brew "automake"
brew "cmake"
brew "cocoapods"
brew "just"
brew "terror/tap/just-lsp"

# ─── Container & Virtualization ──────────────────────────────────────────────
brew "colima"
brew "dive"
brew "docker"
brew "qemu"

# ─── Kubernetes ──────────────────────────────────────────────────────────────
brew "argocd"
brew "chart-testing"
brew "istioctl"
brew "k3d"
brew "k9s"
brew "kind"
brew "krew"
brew "kubeconform"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "skaffold"
brew "atombender/ktail/ktail"

# ─── Cloud CLIs ──────────────────────────────────────────────────────────────
brew "azure-cli"
brew "doctl"
brew "hcloud"

# ─── Infrastructure as Code ──────────────────────────────────────────────────
brew "conftest"
brew "hcl2json"
brew "helm"
brew "helmfile"
brew "infracost"
brew "terraform-docs"
brew "terragrunt"
brew "terramate"
brew "tflint"
brew "hashicorp/tap/terraform-ls"
brew "norwoodj/tap/helm-docs"

# ─── Security & Secrets ──────────────────────────────────────────────────────
brew "certigo"
brew "cosign"
brew "gnupg"
brew "mkcert"
brew "nss"
brew "openssh"
brew "pam-u2f"
brew "pinentry-mac"
brew "pwgen"
brew "sops"
brew "ykman"
brew "hashicorp/tap/vault"

# ─── CI/CD & Release ─────────────────────────────────────────────────────────
brew "bats-core"
brew "mockery"
brew "shellcheck"
brew "shfmt"

# ─── GitHub / GitLab ─────────────────────────────────────────────────────────
brew "gh"
brew "glab"
brew "ankitpokhrel/jira-cli/jira-cli"

# ─── Network Tools ───────────────────────────────────────────────────────────
brew "hey"
brew "mosh"
brew "nmap"
brew "socat"
brew "sshuttle"
brew "vegeta"
brew "wireguard-tools"

# ─── Data, JSON & Templating ─────────────────────────────────────────────────
brew "cue"
brew "fx"
brew "gron"
brew "jless"
brew "jq"
brew "yq"

# ─── Databases ───────────────────────────────────────────────────────────────
brew "libpq"
brew "mdbtools"
brew "pgcli"
brew "postgresql@14"

# ─── Monitoring & Observability ──────────────────────────────────────────────
brew "logcli"

# ─── Media ───────────────────────────────────────────────────────────────────
brew "ffmpeg"
brew "gifsicle"
brew "imagemagick"
brew "pandoc"
brew "poppler"

# ─── File & Storage ──────────────────────────────────────────────────────────
brew "rclone"
brew "restic"

# ─── Miscellaneous ───────────────────────────────────────────────────────────
brew "graphviz"
brew "mas"
brew "neovim"
brew "terminal-notifier"
brew "cloudflare/cloudflare/cf-terraforming"

# ─── Build Dependencies (explicit) ───────────────────────────────────────────
brew "edencommon"
brew "fb303"
brew "fbthrift"
brew "fizz"
brew "folly"
brew "gettext"
brew "gobject-introspection"
brew "harfbuzz"
brew "libtool"
brew "netpbm"
brew "openblas"
brew "openjdk"
brew "pkgconf"
brew "wangle"

# ─── Casks ───────────────────────────────────────────────────────────────────
cask "1password-cli"
cask "caffeine"
cask "coconutbattery"
cask "font-hack-nerd-font"
cask "font-sf-mono-for-powerline"
cask "gcloud-cli"
cask "ghostty"
cask "keybase"
cask "mongodb-compass"
cask "signal"
cask "swiftbar"

# ─── Mac App Store ───────────────────────────────────────────────────────────
mas "Bitwarden", id: 1352778147
mas "Flow", id: 1423210932
mas "Microsoft Remote Desktop", id: 1295203466

# ─── VSCode Extensions ───────────────────────────────────────────────────────
vscode "ahmadalli.vscode-nginx-conf"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewmarkle.primer-light"
vscode "anoff.theme-monokai-light"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bokuweb.vscode-ripgrep"
vscode "casualjim.gotemplate"
vscode "chdsbd.github-code-owners"
vscode "chintans98.markdown-jira"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-markdown"
vscode "grafana.vscode-jsonnet"
vscode "donjayamanne.python-environment-manager"
vscode "dynoser.helml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntwork.terragrunt-ls"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hyzeta.vscode-theme-github-light"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jakebathman.nginx-log-highlighter"
vscode "jallen7usa.vscode-cue-fmt"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jetmartin.bats"
vscode "joshuapoehls.json-escaper"
vscode "mrmlnc.vscode-json5"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marcostazi.vs-code-vagrantfile"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "mineiros.terramate"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "nickgo.cuelang"
vscode "nefrob.vscode-just-syntax"
vscode "nsfilho.tosnippet"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "phplasma.csv-to-table"
vscode "premparihar.gotestexplorer"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "samuelcolvin.jinjahtml"
vscode "shanoor.vscode-nginx"
vscode "tamasfe.even-better-toml"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tsandall.opa"
vscode "tanaka-x.prop2yaml"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "tylerharris.terraform-link-docs"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "windmilleng.vscode-go-autotest"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "xaver.theme-ysgrifennwr"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
