tap "alecthomas/tap"
tap "aquasecurity/trivy"
tap "atombender/ktail"
tap "civo/tools"
tap "cloudflare/cloudflare"
tap "doctave/doctave"
tap "dopplerhq/cli"
tap "ethereum/ethereum"
tap "fairwindsops/tap"
tap "gabrie30/utils"
tap "getsentry/tools"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "johanhaleby/kubetail"
tap "kyma-incubator/kyma-incubator"
tap "liamg/tfsec"
tap "linuxkit/linuxkit"
tap "minamijoyo/tfmigrate"
tap "minio/stable"
tap "mongodb/brew"
tap "norwoodj/tap"
tap "phrase/brewed"
tap "profclems/tap"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "sigstore/tap"
tap "vmware-tanzu/buildkit-cli-for-kubectl", "https://github.com/vmware-tanzu/buildkit-cli-for-kubectl"
tap "weaveworks/tap"
tap "windmilleng/tap"
tap "zaquestion/tap"
brew "adr-tools"
brew "yamllint"
brew "ansible-lint"
brew "gettext"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "python@3.9"
brew "awk"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bcrypt"
brew "harfbuzz"
brew "bfg"
brew "caddy"
brew "calicoctl"
brew "certigo"
brew "chart-testing"
brew "checkov"
brew "cilium-cli"
brew "cli53"
brew "cmake"
brew "cocoapods"
brew "cosign"
brew "cue"
brew "curl"
brew "dive"
brew "docker-machine-driver-hyperkit"
brew "doctl"
brew "folly"
brew "edencommon"
brew "ethereum"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "ffmpeg"
brew "fish"
brew "fluxctl"
brew "flyctl"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-crypt"
brew "git-gui"
brew "git-lfs"
brew "gitleaks"
brew "gitui"
brew "glab"
brew "gmailctl"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "netpbm"
brew "python@3.8"
brew "graphviz"
brew "grep"
brew "gzip"
brew "hcloud"
brew "helm"
brew "helmfile"
brew "hey"
brew "htop"
brew "hub"
brew "hugo"
brew "icdiff"
brew "imagemagick"
brew "infracost"
brew "jless"
brew "jq"
brew "k3d"
brew "k6"
brew "k9s"
brew "keptn"
brew "kind"
brew "kompose"
brew "krew"
brew "kube-linter"
brew "kubectx"
brew "kubeless"
brew "kubeseal"
brew "kubeval"
brew "kustomize"
brew "libpq", link: true
brew "logcli"
brew "make"
brew "mas"
brew "maven"
brew "mdbtools"
brew "minikube"
brew "mkcert"
brew "mongodb-community@4.0"
brew "mosh"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nss"
brew "octant"
brew "openblas"
brew "socat"
brew "openshift-cli"
brew "openssh"
brew "packer"
brew "pam-u2f"
brew "pandoc"
brew "parallel"
brew "pgcli"
brew "pidgin"
brew "pinentry-mac"
brew "pre-commit"
brew "putty"
brew "pv"
brew "pwgen"
brew "qemu"
brew "rclone"
brew "restic"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "semgrep"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "sops"
brew "starship"
brew "stern"
brew "telnet"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tmux"
brew "tree"
brew "unzip"
brew "vegeta"
brew "velero"
brew "watch"
brew "watchman"
brew "wget"
brew "whois"
brew "wireguard-tools"
brew "xhyve"
brew "ykman"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "alecthomas/tap/gometalinter"
brew "aquasecurity/trivy/trivy"
brew "atombender/ktail/ktail"
brew "civo/tools/civo"
brew "dopplerhq/cli/doppler", link: false
brew "fairwindsops/tap/pluto"
brew "fairwindsops/tap/rbac-lookup"
brew "gabrie30/utils/ghorg"
brew "getsentry/tools/sentry-cli"
brew "golangci/tap/golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/vault"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "kyma-incubator/kyma-incubator/kyma-cli"
brew "liamg/tfsec/tfsec"
brew "linuxkit/linuxkit/linuxkit", args: ["HEAD"]
brew "minamijoyo/tfmigrate/tfmigrate"
brew "minio/stable/minio"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-community@4.2"
brew "norwoodj/tap/helm-docs"
brew "phrase/brewed/phraseapp"
brew "rhyeal/aws-rotate-iam-keys/aws-rotate-iam-keys"
brew "sigstore/tap/gitsign"
brew "weaveworks/tap/eksctl"
brew "windmilleng/tap/tilt"
brew "zaquestion/tap/lab"
cask "1password-cli"
cask "alacritty"
cask "caffeine"
cask "cf-terraforming"
cask "coconutbattery"
cask "google-cloud-sdk"
cask "keybase"
cask "kitty"
cask "minishift"
cask "session-manager-plugin"
cask "signal"
cask "vagrant"
mas "Amphetamine", id: 937984704
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Twitter", id: 1482454543
