code --install-extension ahmadalli.vscode-nginx-conf
code --install-extension akamud.vscode-theme-onedark
code --install-extension akamud.vscode-theme-onelight
code --install-extension alexkrechik.cucumberautocomplete
code --install-extension andrewmarkle.primer-light
code --install-extension anoff.theme-monokai-light
code --install-extension bierner.markdown-preview-github-styles
code --install-extension bokuweb.vscode-ripgrep
code --install-extension bradlc.vscode-tailwindcss
code --install-extension bungcip.better-toml
code --install-extension burkeholland.simple-react-snippets
code --install-extension casualjim.gotemplate
code --install-extension chintans98.markdown-jira
code --install-extension christian-kohler.npm-intellisense
code --install-extension christian-kohler.path-intellisense
code --install-extension cssho.vscode-svgviewer
code --install-extension DavidAnson.vscode-markdownlint
code --install-extension dbaeumer.vscode-eslint
code --install-extension docsmsft.docs-markdown
code --install-extension dracula-theme.theme-dracula
code --install-extension dsznajder.es7-react-js-snippets
code --install-extension EditorConfig.EditorConfig
code --install-extension eg2.vscode-npm-script
code --install-extension Equinusocio.vsc-community-material-theme
code --install-extension esbenp.prettier-vscode
code --install-extension fosshaas.fontsize-shortcuts
code --install-extension foxundermoon.shell-format
code --install-extension GitLab.gitlab-workflow
code --install-extension golang.go
code --install-extension hangxingliu.vscode-nginx-conf-hint
code --install-extension hashicorp.terraform
code --install-extension hediet.vscode-drawio
code --install-extension Hyzeta.vscode-theme-github-light
code --install-extension jakebathman.nginx-log-highlighter
code --install-extension jallen7usa.vscode-cue-fmt
code --install-extension jasonnutter.search-node-modules
code --install-extension jawandarajbir.react-vscode-extension-pack
code --install-extension jetmartin.bats
code --install-extension jock.svg
code --install-extension joshuapoehls.json-escaper
code --install-extension mads-hartmann.bash-ide-vscode
code --install-extension marcostazi.VS-code-vagrantfile
code --install-extension max-SS.Cyberpunk
code --install-extension mongodb.mongodb-vscode
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools
code --install-extension ms-python.isort
code --install-extension ms-python.python
code --install-extension ms-python.vscode-pylance
code --install-extension ms-vscode-remote.remote-containers
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-vscode-remote.remote-ssh-edit
code --install-extension ms-vscode.azure-account
code --install-extension ms-vscode.remote-explorer
code --install-extension ms-vsliveshare.vsliveshare
code --install-extension msjsdiag.vscode-react-native
code --install-extension mushan.vscode-paste-image
code --install-extension nickgo.cuelang
code --install-extension nikitaKunevich.snippet-creator
code --install-extension nsfilho.tosnippet
code --install-extension octref.vetur
code --install-extension premparihar.gotestexplorer
code --install-extension raynigon.nginx-formatter
code --install-extension rebornix.ruby
code --install-extension redhat.java
code --install-extension redhat.vscode-commons
code --install-extension redhat.vscode-yaml
code --install-extension rogalmic.bash-debug
code --install-extension samuelcolvin.jinjahtml
code --install-extension shanoor.vscode-nginx
code --install-extension SimonSiefke.svg-preview
code --install-extension tanaka-x.prop2yaml
code --install-extension tht13.python
code --install-extension Tim-Koehler.helm-intellisense
code --install-extension timonwong.shellcheck
code --install-extension uloco.theme-bluloco-dark
code --install-extension uloco.theme-bluloco-light
code --install-extension VisualStudioExptTeam.intellicode-api-usage-examples
code --install-extension VisualStudioExptTeam.vscodeintellicode
code --install-extension vscjava.vscode-java-debug
code --install-extension vscjava.vscode-java-dependency
code --install-extension vscjava.vscode-java-pack
code --install-extension vscjava.vscode-java-test
code --install-extension vscjava.vscode-maven
code --install-extension vscodevim.vim
code --install-extension william-voyek.vscode-nginx
code --install-extension windmilleng.vscode-go-autotest
code --install-extension wingrunr21.vscode-ruby
code --install-extension xabikos.JavaScriptSnippets
code --install-extension xabikos.ReactSnippets
code --install-extension xaver.theme-ysgrifennwr
code --install-extension yzhang.markdown-all-in-one
code --install-extension zxh404.vscode-proto3
