code --install-extension 42Crunch.vscode-openapi
code --install-extension bungcip.better-toml
code --install-extension chintans98.markdown-jira
code --install-extension cssho.vscode-svgviewer
code --install-extension DavidAnson.vscode-markdownlint
code --install-extension docsmsft.docs-markdown
code --install-extension eamodio.gitlens
code --install-extension esbenp.prettier-vscode
code --install-extension fosshaas.fontsize-shortcuts
code --install-extension foxundermoon.shell-format
code --install-extension GitLab.gitlab-workflow
code --install-extension golang.Go
code --install-extension hangxingliu.vscode-nginx-conf-hint
code --install-extension hashicorp.terraform
code --install-extension hediet.vscode-drawio
code --install-extension jakebathman.nginx-log-highlighter
code --install-extension jetmartin.bats
code --install-extension joaompinto.asciidoctor-vscode
code --install-extension jock.svg
code --install-extension mads-hartmann.bash-ide-vscode
code --install-extension marcostazi.VS-code-vagrantfile
code --install-extension mathiasfrohlich.Kotlin
code --install-extension mermade.openapi-lint
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools
code --install-extension ms-vscode-remote.remote-containers
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-vscode-remote.remote-ssh-edit
code --install-extension ms-vscode.azure-account
code --install-extension naco-siren.gradle-language
code --install-extension octref.vetur
code --install-extension premparihar.gotestexplorer
code --install-extension raynigon.nginx-formatter
code --install-extension rebornix.ruby
code --install-extension redhat.java
code --install-extension redhat.vscode-openshift-connector
code --install-extension redhat.vscode-yaml
code --install-extension rogalmic.bash-debug
code --install-extension samuelcolvin.jinjahtml
code --install-extension shanoor.vscode-nginx
code --install-extension tanaka-x.prop2yaml
code --install-extension timonwong.shellcheck
code --install-extension uloco.theme-bluloco-dark
code --install-extension VisualStudioExptTeam.vscodeintellicode
code --install-extension vscjava.vscode-java-debug
code --install-extension vscjava.vscode-java-dependency
code --install-extension vscjava.vscode-java-pack
code --install-extension vscjava.vscode-java-test
code --install-extension vscjava.vscode-maven
code --install-extension vscodevim.vim
code --install-extension william-voyek.vscode-nginx
code --install-extension windmilleng.vscode-go-autotest
code --install-extension wingrunr21.vscode-ruby
code --install-extension yzhang.markdown-all-in-one
