code --install-extension fosshaas.fontsize-shortcuts
code --install-extension hangxingliu.vscode-nginx-conf-hint
code --install-extension jakebathman.nginx-log-highlighter
code --install-extension joaompinto.asciidoctor-vscode
code --install-extension juliosueiras.vscode-languageclient-terraform
code --install-extension mauve.terraform
code --install-extension ms-azuretools.vscode-azureterraform
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools
code --install-extension ms-vscode.azure-account
code --install-extension ms-vscode.Go
code --install-extension premparihar.gotestexplorer
code --install-extension raynigon.nginx-formatter
code --install-extension rebornix.ruby
code --install-extension redhat.vscode-openshift-connector
code --install-extension redhat.vscode-yaml
code --install-extension shanoor.vscode-nginx
code --install-extension timonwong.shellcheck
code --install-extension uloco.theme-bluloco-dark
code --install-extension william-voyek.vscode-nginx
code --install-extension windmilleng.vscode-go-autotest
